## Overview of the DataSet

SpaceX has gained worldwide attention for a series of historic milestones. 

It is the only private company ever to return a spacecraft from low-earth orbit, which it first accomplished in December 2010.
SpaceX advertises Falcon 9 rocket launches on its website with a cost of 62 million dollars wheras other providers cost upward of 165 million dollars each, much of the savings is because Space X can reuse the first stage. 


Therefore if we can determine if the first stage will land, we can determine the cost of a launch. 

This information can be used if an alternate company wants to bid against SpaceX for a rocket launch.

This dataset includes a record for each payload carried during a SpaceX mission into outer space.

In [ ]:
!pip install sqlalchemy==1.3.9

### Connect to the database

Let us first load the SQL extension and establish a connection with the database

In [ ]:
!pip install ipython-sql
!pip install ipython-sql prettytable

%load_ext sql

In [13]:
import csv, sqlite3
import prettytable
prettytable.DEFAULT = 'DEFAULT'

con = sqlite3.connect("my_data1.db") #conxn name in the argument
cur = con.cursor()

In [16]:
%sql sqlite:///my_data1.db

In [18]:
# import the df and convrt tot sql
import pandas as pd
df = pd.read_csv("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv")
df.to_sql("SPACEXTBL", con, if_exists='replace', index=False,method="multi")

101

**Note:This below code is added to remove blank rows from table**

In [24]:
#DROP THE TABLE IF EXISTS

%sql DROP TABLE IF EXISTS SPACEXTABLE;

 * sqlite:///my_data1.db
Done.

[]

In [26]:
%sql create table SPACEXTABLE as select * from SPACEXTBL where Date is not null

 * sqlite:///my_data1.db
Done.

[]

In [40]:
%sql SELECT * from   SPACEXTABLE limit 5

 * sqlite:///my_data1.db
Done.

[('2010-06-04', '18:45:00', 'F9 v1.0  B0003', 'CCAFS LC-40', 'Dragon Spacecraft Qualification Unit', 0, 'LEO', 'SpaceX', 'Success', 'Failure (parachute)'),
 ('2010-12-08', '15:43:00', 'F9 v1.0  B0004', 'CCAFS LC-40', 'Dragon demo flight C1, two CubeSats, barrel of Brouere cheese', 0, 'LEO (ISS)', 'NASA (COTS) NRO', 'Success', 'Failure (parachute)'),
 ('2012-05-22', '7:44:00', 'F9 v1.0  B0005', 'CCAFS LC-40', 'Dragon demo flight C2', 525, 'LEO (ISS)', 'NASA (COTS)', 'Success', 'No attempt'),
 ('2012-10-08', '0:35:00', 'F9 v1.0  B0006', 'CCAFS LC-40', 'SpaceX CRS-1', 500, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt'),
 ('2013-03-01', '15:10:00', 'F9 v1.0  B0007', 'CCAFS LC-40', 'SpaceX CRS-2', 677, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt')]

## Tasks

Now write and execute SQL queries to solve the assignment tasks.

**Note: If the column names are in mixed case enclose it in double quotes
   For Example "Landing_Outcome"**

### Task 1




##### Display the names of the unique launch sites  in the space mission

In [62]:
%sql SELECT DISTINCT "Launch_Site" FROM SPACEXTBL

 * sqlite:///my_data1.db
Done.

[('CCAFS LC-40',), ('VAFB SLC-4E',), ('KSC LC-39A',), ('CCAFS SLC-40',)]


### Task 2


#####  Display 5 records where launch sites begin with the string 'CCA'

In [80]:
query = 'SELECT * FROM SPACEXTBL WHERE "Launch_Site" LIKE "CCA%" LIMIT 5'
records = pd.read_sql_query(query, con)

# Display the records
print(records)

         Date Time (UTC) Booster_Version  Launch_Site  \
0  2010-06-04   18:45:00  F9 v1.0  B0003  CCAFS LC-40
1  2010-12-08   15:43:00  F9 v1.0  B0004  CCAFS LC-40
2  2012-05-22    7:44:00  F9 v1.0  B0005  CCAFS LC-40
3  2012-10-08    0:35:00  F9 v1.0  B0006  CCAFS LC-40
4  2013-03-01   15:10:00  F9 v1.0  B0007  CCAFS LC-40

                                             Payload  PAYLOAD_MASS__KG_  \
0               Dragon Spacecraft Qualification Unit                  0
1  Dragon demo flight C1, two CubeSats, barrel of...                  0
2                              Dragon demo flight C2                525
3                                       SpaceX CRS-1                500
4                                       SpaceX CRS-2                677

       Orbit         Customer Mission_Outcome      Landing_Outcome
0        LEO           SpaceX         Success  Failure (parachute)
1  LEO (ISS)  NASA (COTS) NRO         Success  Failure (parachute)
2  LEO (ISS)      NASA (COTS)         Success           No attempt
3  LEO (ISS)       NASA (CRS)         Success           No attempt
4  LEO (ISS)       NASA (CRS)         Success           No attempt

### Task 3




##### Display the total payload mass carried by boosters launched by NASA (CRS)

In [88]:
# Execute the SQL query to get the total payload mass 
query = 'SELECT SUM("PAYLOAD_MASS__KG_") AS Total_Payload_Mass FROM SPACEXTBL WHERE "Customer" = "NASA (CRS)"' 
total_payload_mass = pd.read_sql_query(query, con) 

# Display the total payload mass 
print(total_payload_mass)

   Total_Payload_Mass
0               45596

### Task 4




##### Display average payload mass carried by booster version F9 v1.1

In [96]:
# Execute the SQL query
query = 'SELECT AVG("PAYLOAD_MASS__KG_") AS Avg_Payload_Mass FROM SPACEXTBL WHERE "Booster_version" = "F9 v1.1"' 
avg_payload_mass = pd.read_sql_query(query, con) 

# Display the total payload mass 
print(avg_payload_mass)

   Avg_Payload_Mass
0            2928.4

### Task 5

##### List the date when the first succesful landing outcome in ground pad was acheived.


_Hint:Use min function_

In [104]:
query= ' SELECT MIN("Date") as First FROM SPACEXTBL WHERE "Landing_Outcome" like "%ground%"'
first_land=pd.read_sql_query(query, con) 

#display
print(first_land)

        First
0  2015-12-22

### Task 6

##### List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000

In [146]:
query= ' SELECT "Booster_Version" FROM SPACEXTBL WHERE "Landing_Outcome" LIKE "%drone%" AND "PAYLOAD_MASS__KG_" BETWEEN 4000 AND 6000 '
booste=pd.read_sql_query(query, con) 

#display
print(booste)

  Booster_Version
0     F9 FT B1020
1     F9 FT B1022
2     F9 FT B1026
3  F9 FT  B1021.2
4  F9 FT  B1031.2

### Task 7




##### List the total number of successful and failure mission outcomes

In [154]:
query= ' SELECT "Landing_Outcome" ,COUNT(*) AS Outcome_Count FROM SPACEXTBL GROUP BY "Landing_Outcome" '

tot=pd.read_sql_query(query, con) 

#display
print(tot)

           Landing_Outcome  Outcome_Count
0       Controlled (ocean)              5
1                  Failure              3
2     Failure (drone ship)              5
3      Failure (parachute)              2
4               No attempt             21
5              No attempt               1
6   Precluded (drone ship)              1
7                  Success             38
8     Success (drone ship)             14
9     Success (ground pad)              9
10    Uncontrolled (ocean)              2

### Task 8



##### List the   names of the booster_versions which have carried the maximum payload mass. Use a subquery

In [156]:
query='SELECT "Booster_Version" FROM SPACEXTBL WHERE "PAYLOAD_MASS__KG_" = (SELECT MAX("PAYLOAD_MASS__KG_")FROM SPACEXTBL)'
name=pd.read_sql_query(query, con) 

#display
print(name)

   Booster_Version
0    F9 B5 B1048.4
1    F9 B5 B1049.4
2    F9 B5 B1051.3
3    F9 B5 B1056.4
4    F9 B5 B1048.5
5    F9 B5 B1051.4
6    F9 B5 B1049.5
7   F9 B5 B1060.2
8   F9 B5 B1058.3
9    F9 B5 B1051.6
10   F9 B5 B1060.3
11  F9 B5 B1049.7

### Task 9


##### List the records which will display the month names, failure landing_outcomes in drone ship ,booster versions, launch_site for the months in year 2015.

**Note: SQLLite does not support monthnames. So you need to use  substr(Date, 6,2) as month to get the months and substr(Date,0,5)='2015' for year.**

substr("Date", 6, 2):

substr is a function that extracts a substring from a string.

"Date" is the column from which we want to extract the substring.

6 is the starting position for the substring (1-based index). This means the extraction starts from the 6th character of the Date string.

2 is the length of the substring to be extracted. This means we are extracting 2 characters starting from the 6th character.

In [160]:
# Execute the SQL query to get the records 
query = ''' 
SELECT 
   substr("Date", 6, 2) AS Month, 
   "Landing_Outcome", 
   "Booster_Version", 
   "Launch_Site" 
FROM SPACEXTBL 
WHERE "Landing_Outcome" LIKE '%drone%' 
AND "Landing_Outcome" LIKE '%failure%' 
AND substr("Date", 1, 4) = '2015'; 
''' 
records = pd.read_sql_query(query, con) 
# Display the result 
print(records)

  Month       Landing_Outcome Booster_Version  Launch_Site
0    01  Failure (drone ship)   F9 v1.1 B1012  CCAFS LC-40
1    04  Failure (drone ship)   F9 v1.1 B1015  CCAFS LC-40

### Task 10




##### Rank the count of landing outcomes (such as Failure (drone ship) or Success (ground pad)) between the date 2010-06-04 and 2017-03-20, in descending order.

In [162]:
# Execute the SQL query to rank the count of landing outcomes
query = ''' 
SELECT "Landing_Outcome", COUNT(*) AS Outcome_Count 
FROM SPACEXTBL 
WHERE "Date" BETWEEN '2010-06-04' AND '2017-03-20' 
GROUP BY "Landing_Outcome"
ORDER BY Outcome_Count DESC 
''' 

landing_outcomes_ranked = pd.read_sql_query(query, con) 
# Display the result 
print(landing_outcomes_ranked)

          Landing_Outcome  Outcome_Count
0              No attempt             10
1    Success (drone ship)              5
2    Failure (drone ship)              5
3    Success (ground pad)              3
4      Controlled (ocean)              3
5    Uncontrolled (ocean)              2
6     Failure (parachute)              2
7  Precluded (drone ship)              1